 "calories": [
    { "id": 1, "food": "Gado-gado", "harga": "Rp.50.000", "resep": "Bahan-bahan	
3 - 4 porsi
100 ml santan kental
100 gr gula aren
4 potong Tahu goreng
1 sdm maizena, larutkan
2 butir telur ayam, rebus
3 lontong
150 gr tauge, seduh air panas
Tomat merah segar
secukupnya Selada
3 buah kentang, kukus
Timun, iris tipis
Gula dan garam
400 ml air
Bahan yang Dihaluskan :
150 gr kacang sambel/kacang kulit, goreng matang
4 cabe rawit
5 siung bawang putih
Langkah	
25 menit
Tuang bahan yang dihaluskan ke dalam panci, beri air secukupnya. Nyalakan api sedang.

  
Masukkan gula aren, garam dan gula pasir (opsional). Aduk merata. Jelang mendidih, tambahkan santan, lalu kecilkan api. Koreksi rasa.

  
Tambahkan larutan maizena sedikit demi sedikit, sampai tingkat kekentalan yg diinginkan. Jika sudah meletup, matikan api.

  
Tata isian gado-gado, seperti lontong, selada, kentang, tomat, tauge, tahu goreng dan timun. Siram bumbu kacang.

  
Sajikan dengan telur rebus dan kerupuk serta emping melinjo (opsional). Happy Cooking ❤❤" },
    { "id": 2, "food": "Rawon", "harga": "Rp.20.000", "resep":"Bahan:
500 gram daging sandung lamur (brisket)
6 lembar daun jeruk
3 batang serai, geprek
3 liter air
1 ruas lengkuas, geprek
 

Bumbu halus:
8 siung bawang merah
5 siung bawang putih
4 buah kluwek ukuran sedang, keruk isinya
4 butir kemiri, sangrai
2 cm kunyit
1 1/2 sdt ketumbar bubuk
1 sendok teh merica
1 cm jahe
1 batang bawang perai dipotong-potong
Garam secukupnya
Gula secukupnya
 

Bahan pelengkap:
bawang goreng secukupnya
tauge pendek secukupnya
sambal terasi
kerupuk udang
telur asin
 

Cara membuat:
Rebus daging dalam air mendidih hingga cukup empuk. Setelah itu angkat dari air rebusan dan potong-potong seukuran satu suapan.
Saring air kaldu dari rebusan tadi, kemudian lalu masukkan kembali daging yg telah dipotong bersama serai, daun jeruk dan lengkuas.
Tumis bumbu halus dengan sedikit minyak hingga harum, kemudian masukkan ke dalam rebusan daging.
Masak sampai daging empuk. Apabila air menyusut dan daging belum empuk, tambahkan air secukupnya dan masak rawon sampai daging benar-benar lunak.
Sesaat sebelum diangkat, masukkan irisan daun bawang.
Demikian resep rawon daging otentik. Hidangkan rawon bersama pelengkap dan nasi panas." }
     
  ]
